1차 22-05-18 Fail

회고
진짜 어려운 문제였는데 풀이보니까 진짜 미친놈이가 싶다.

class Solution {
public:
    /*
    문제:
    정수 배열 nums가 주어진다.
    nums에는 단 하나의 요소만을 제외하고는 모든 요소가 두번 등장한다.
    그 단 하나의 요소를 찾아라.
    
    반드시 "상수 공간"과 
    "선형 시간"만을 이용해라.
    
    
    
    제한:
    
    해결방법:
    1) nums[i]가 -30000부터 30000까지니까  bool visit[60001] 만들어서 체크하기. -> 상수 공간 X
    2) 전체 정렬한 다음에 카운팅하면서 넘어가기. -> 선형 시간 X
    3) Array Sum:
    -> set을 이용해서 각 unique 요소만 저장. set의 총 합 * 2 = sum1
    -> nums의 요소 합 = totalSum
    -> sum1 - totalSum = uniqueValue
    -> 이건 좋은 아이디어긴 한데 set의 space complexity 고려
    4) 🎃XOR 풀이방법
    -> XOR은 각 요소가 다르면 true를 리턴한다. 만약 두 요소가 같으면 false를 나타냄
    -> XOR의 사용경우를 확장하면 A^A = 0, A^A^A = A, A^B^A = B, A^A^B = B, B^A^A = B
    -> 결국 num 순회하면서 XOR 하면 됨.
    */
    
    int singleNumber(vector<int>& nums) { 
       int ans=0;
	     for(auto x:nums)
	        ans^=x;
	     return ans;
    }
};
