Fail

문제:
nums배열의 bitwise AND는 nums에 있는 모든 정수를 bitwise AND 한 것이다.
candidates 라는, 양의 정수 배열이 주어진다.
candidates의 숫자들의 모든 조합에 대하여 bitwise AND를 평가해라.
candidates에 있는 각각의 숫자는 각각의 조합에서 한번만 사용될 것이다.
candidates의 모든 조합에 대한 가장 큰 사이즈를 리턴해라. 이 조합의 bitwise AND의 결과는 0보다 커야 한다.

제한:
candidates의 길이는 십만
candidates[i]는 1 이상 천만 이하.

해결방법:

내가 생각했던 흐름들(1~4)
1) 십만 배열의 길이에 대해 모든 조합을 만든다?
->터무늬 없는 얘기이다.

2)candidates의 모든 수들에 대해 &연산을 하고, 재귀를 돌리면서 각각 진행한다?
->십만에 대해 팩토리얼이 나올 수도 있다.

3)candidates의 길이가 홀수라면 반드시 0보다 크다? X 아님.

4)🎈정답: 가장 최대의 수를 찾아서 그 수와 비트 1 이 겹치는게 최대 몇개까지 있는지를 알아낸다.
->왜 최대의 수를 찾아야 하는가? 최대의 수가 가장 비트 자릿수가 길 수밖에 없다.
->참고: https://leetcode.com/problems/largest-combination-with-bitwise-and-greater-than-zero/discuss/2039717/Check-Each-Bit
위 링크에서 댓글에 잘 설명이 되어 있다.
16 = 0 0 1 0 0 0 0
17 = 0 0 1 0 0 0 1
71 = 1 0 0 0 1 1 1
62 = 0 1 1 1 1 1 0
12 = 0 0 0 1 1 0 0
24 = 0 0 1 1 0 0 0
14 = 0 0 0 1 1 1 0

int largestCombination(vector<int>& cs) {
    int res = 0, max_e = *max_element(begin(cs), end(cs));
    for (int b = 1; b <= max_e; b <<= 1) {
        int cnt = 0;
        for (auto n : cs)
            cnt += (n & b) > 0;
        res = max(res, cnt);
    }
    return res;
}
